Tekla Open API Reference for Tekla Structures 2025
Angle.Equals Method
 Checks for approximate angle equality
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Equals(
	Angle other
)
Public Function Equals (
	other As Angle
) As Boolean
Parameters
other
Type: Tekla.Structures.Datatype.Angle
Angle to compare to
Return Value
Type: Boolean
True if the angles are the same, false otherwise
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace